IOTracer_tests/ycsb_tests/ycsb_results_ringbuf_128mb
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 23313
[OVERALL], Throughput(ops/sec), 4289.452236949342
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 66
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.28310384763865654
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 66
[TOTAL_GC_TIME_%], Time(%), 0.28310384763865654
[READ], Operations, 59992
[READ], AverageLatency(us), 213.4672789705294
[READ], MinLatency(us), 104
[READ], MaxLatency(us), 61759
[READ], 95thPercentileLatency(us), 379
[READ], 99thPercentileLatency(us), 684
[READ], Return=OK, 59992
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1539.0
[CLEANUP], MinLatency(us), 1539
[CLEANUP], MaxLatency(us), 1539
[CLEANUP], 95thPercentileLatency(us), 1539
[CLEANUP], 99thPercentileLatency(us), 1539
[UPDATE], Operations, 40008
[UPDATE], AverageLatency(us), 236.49712557488502
[UPDATE], MinLatency(us), 117
[UPDATE], MaxLatency(us), 8575
[UPDATE], 95thPercentileLatency(us), 425
[UPDATE], 99thPercentileLatency(us), 745
[UPDATE], Return=OK, 40008
n------------------------------------------n
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 25786
[OVERALL], Throughput(ops/sec), 3878.07337314822
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 78
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.30248972310556116
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 78
[TOTAL_GC_TIME_%], Time(%), 0.30248972310556116
[READ], Operations, 59921
[READ], AverageLatency(us), 237.02036014085212
[READ], MinLatency(us), 105
[READ], MaxLatency(us), 19039
[READ], 95thPercentileLatency(us), 456
[READ], 99thPercentileLatency(us), 734
[READ], Return=OK, 59921
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1403.0
[CLEANUP], MinLatency(us), 1403
[CLEANUP], MaxLatency(us), 1403
[CLEANUP], 95thPercentileLatency(us), 1403
[CLEANUP], 99thPercentileLatency(us), 1403
[UPDATE], Operations, 40079
[UPDATE], AverageLatency(us), 263.2492327652886
[UPDATE], MinLatency(us), 119
[UPDATE], MaxLatency(us), 50431
[UPDATE], 95thPercentileLatency(us), 515
[UPDATE], 99thPercentileLatency(us), 784
[UPDATE], Return=OK, 40079
n------------------------------------------n
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 31397
[OVERALL], Throughput(ops/sec), 3185.0176768481065
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 73
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.23250629040991178
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 73
[TOTAL_GC_TIME_%], Time(%), 0.23250629040991178
[READ], Operations, 60051
[READ], AverageLatency(us), 287.8513596776074
[READ], MinLatency(us), 104
[READ], MaxLatency(us), 62047
[READ], 95thPercentileLatency(us), 601
[READ], 99thPercentileLatency(us), 1061
[READ], Return=OK, 60051
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1669.0
[CLEANUP], MinLatency(us), 1669
[CLEANUP], MaxLatency(us), 1669
[CLEANUP], 95thPercentileLatency(us), 1669
[CLEANUP], 99thPercentileLatency(us), 1669
[UPDATE], Operations, 39949
[UPDATE], AverageLatency(us), 323.60304388094823
[UPDATE], MinLatency(us), 118
[UPDATE], MaxLatency(us), 8207
[UPDATE], 95thPercentileLatency(us), 694
[UPDATE], 99thPercentileLatency(us), 1127
[UPDATE], Return=OK, 39949
n------------------------------------------n
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 24967
[OVERALL], Throughput(ops/sec), 4005.286978812032
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 70
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2803700885168422
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 70
[TOTAL_GC_TIME_%], Time(%), 0.2803700885168422
[READ], Operations, 60366
[READ], AverageLatency(us), 229.81118510419773
[READ], MinLatency(us), 105
[READ], MaxLatency(us), 17647
[READ], 95thPercentileLatency(us), 421
[READ], 99thPercentileLatency(us), 753
[READ], Return=OK, 60366
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1640.0
[CLEANUP], MinLatency(us), 1640
[CLEANUP], MaxLatency(us), 1640
[CLEANUP], 95thPercentileLatency(us), 1640
[CLEANUP], 99thPercentileLatency(us), 1640
[UPDATE], Operations, 39634
[UPDATE], AverageLatency(us), 254.4261492657819
[UPDATE], MinLatency(us), 118
[UPDATE], MaxLatency(us), 74303
[UPDATE], 95thPercentileLatency(us), 470
[UPDATE], 99thPercentileLatency(us), 799
[UPDATE], Return=OK, 39634
n------------------------------------------n