IOTracer_tests/ycsb_tests/ycsb_results_ringbuf_4mb
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 36703
[OVERALL], Throughput(ops/sec), 2724.572923194289
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 80
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.21796583385554316
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 80
[TOTAL_GC_TIME_%], Time(%), 0.21796583385554316
[READ], Operations, 59641
[READ], AverageLatency(us), 336.1477507084053
[READ], MinLatency(us), 112
[READ], MaxLatency(us), 13191
[READ], 95thPercentileLatency(us), 665
[READ], 99thPercentileLatency(us), 1107
[READ], Return=OK, 59641
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1614.0
[CLEANUP], MinLatency(us), 1614
[CLEANUP], MaxLatency(us), 1614
[CLEANUP], 95thPercentileLatency(us), 1614
[CLEANUP], 99thPercentileLatency(us), 1614
[UPDATE], Operations, 40359
[UPDATE], AverageLatency(us), 378.57057905299934
[UPDATE], MinLatency(us), 121
[UPDATE], MaxLatency(us), 75391
[UPDATE], 95thPercentileLatency(us), 750
[UPDATE], 99thPercentileLatency(us), 1205
[UPDATE], Return=OK, 40359
n------------------------------------------n
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 56078
[OVERALL], Throughput(ops/sec), 1783.2305003744784
[TOTAL_GCS_G1_Young_Generation], Count, 14
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 58
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.10342736902171974
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 14
[TOTAL_GC_TIME], Time(ms), 58
[TOTAL_GC_TIME_%], Time(%), 0.10342736902171974
[READ], Operations, 59919
[READ], AverageLatency(us), 521.9781204626246
[READ], MinLatency(us), 104
[READ], MaxLatency(us), 16991
[READ], 95thPercentileLatency(us), 1295
[READ], 99thPercentileLatency(us), 1867
[READ], Return=OK, 59919
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5758.0
[CLEANUP], MinLatency(us), 5756
[CLEANUP], MaxLatency(us), 5759
[CLEANUP], 95thPercentileLatency(us), 5759
[CLEANUP], 99thPercentileLatency(us), 5759
[UPDATE], Operations, 40081
[UPDATE], AverageLatency(us), 575.5997355355405
[UPDATE], MinLatency(us), 116
[UPDATE], MaxLatency(us), 87167
[UPDATE], 95thPercentileLatency(us), 1405
[UPDATE], 99thPercentileLatency(us), 1923
[UPDATE], Return=OK, 40081
n------------------------------------------n
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 43753
[OVERALL], Throughput(ops/sec), 2285.557561767193
[TOTAL_GCS_G1_Young_Generation], Count, 14
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 98
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2239846410531849
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 14
[TOTAL_GC_TIME], Time(ms), 98
[TOTAL_GC_TIME_%], Time(%), 0.2239846410531849
[READ], Operations, 60012
[READ], AverageLatency(us), 383.73390321935614
[READ], MinLatency(us), 104
[READ], MaxLatency(us), 51935
[READ], 95thPercentileLatency(us), 1537
[READ], 99thPercentileLatency(us), 2761
[READ], Return=OK, 60012
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1096.0
[CLEANUP], MinLatency(us), 1096
[CLEANUP], MaxLatency(us), 1096
[CLEANUP], 95thPercentileLatency(us), 1096
[CLEANUP], 99thPercentileLatency(us), 1096
[UPDATE], Operations, 39988
[UPDATE], AverageLatency(us), 429.14721916574973
[UPDATE], MinLatency(us), 116
[UPDATE], MaxLatency(us), 280831
[UPDATE], 95thPercentileLatency(us), 1680
[UPDATE], 99thPercentileLatency(us), 2869
[UPDATE], Return=OK, 39988
n------------------------------------------n
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 24964
[OVERALL], Throughput(ops/sec), 4005.7683063611603
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 69
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.27639801313892004
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 69
[TOTAL_GC_TIME_%], Time(%), 0.27639801313892004
[READ], Operations, 59890
[READ], AverageLatency(us), 227.67305059275338
[READ], MinLatency(us), 103
[READ], MaxLatency(us), 63359
[READ], 95thPercentileLatency(us), 478
[READ], 99thPercentileLatency(us), 940
[READ], Return=OK, 59890
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1417.0
[CLEANUP], MinLatency(us), 1417
[CLEANUP], MaxLatency(us), 1417
[CLEANUP], 95thPercentileLatency(us), 1417
[CLEANUP], 99thPercentileLatency(us), 1417
[UPDATE], Operations, 40110
[UPDATE], AverageLatency(us), 253.33044128646222
[UPDATE], MinLatency(us), 116
[UPDATE], MaxLatency(us), 7243
[UPDATE], 95thPercentileLatency(us), 539
[UPDATE], 99thPercentileLatency(us), 1050
[UPDATE], Return=OK, 40110
n------------------------------------------n
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 23868
[OVERALL], Throughput(ops/sec), 4189.710072063013
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 62
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.25976202446790686
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 62
[TOTAL_GC_TIME_%], Time(%), 0.25976202446790686
[READ], Operations, 59789
[READ], AverageLatency(us), 219.05370553111777
[READ], MinLatency(us), 104
[READ], MaxLatency(us), 61407
[READ], 95thPercentileLatency(us), 419
[READ], 99thPercentileLatency(us), 914
[READ], Return=OK, 59789
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1160.0
[CLEANUP], MinLatency(us), 1160
[CLEANUP], MaxLatency(us), 1160
[CLEANUP], 95thPercentileLatency(us), 1160
[CLEANUP], 99thPercentileLatency(us), 1160
[UPDATE], Operations, 40211
[UPDATE], AverageLatency(us), 242.63629355151576
[UPDATE], MinLatency(us), 116
[UPDATE], MaxLatency(us), 8615
[UPDATE], 95thPercentileLatency(us), 471
[UPDATE], 99thPercentileLatency(us), 944
[UPDATE], Return=OK, 40211
n------------------------------------------n